# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
data1 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv')
data2 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv')

In [3]:
def format_columns(df):
    df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
    df = df.rename(columns = {'st': 'state'})
    return df

def print_unique(df):
    for column in ['state', 'gender', 'policy_type', 'vehicle_class']:
        print(f'{column}: {df[column].unique()}')

def replace(df):
    return df.replace({
    'state' : {'AZ': 'Arizona', 'WA': 'Washington', 'Cali': 'California', 'CA': 'California'},
    'gender': {'female': 'F', 'Male': 'M', 'Femal': 'F'},
    'vehicle_class': {'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury', 'SUV': 'Luxury'}
    'education' : {'Bachelors': 'Bachelor'}})

## Treat naming

In [4]:
data = format_columns(data)
data1 = format_columns(data1)
data2 = format_columns(data2)

print_unique(data)
data = replace(data)

print('\n')
print_unique(data1)
data1 = replace(data1)

print('\n')
print_unique(data2)
data2 = replace(data2)

state: ['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]
gender: [nan 'F' 'M' 'Femal' 'Male' 'female']
policy_type: ['Personal Auto' 'Corporate Auto' 'Special Auto' nan]
vehicle_class: ['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]


state: ['Arizona' 'California' 'Oregon' 'Nevada' 'Washington' 'AZ']
gender: ['F' 'M' nan 'female' 'Male']
policy_type: ['Personal Auto' 'Special Auto' 'Corporate Auto']
vehicle_class: ['Four-Door Car' 'SUV' 'Two-Door Car' 'Luxury Car' 'Sports Car'
 'Luxury SUV']


state: ['Washington' 'Arizona' 'Nevada' 'California' 'Oregon']
gender: ['M' 'F']
policy_type: ['Personal Auto' 'Corporate Auto' 'Special Auto']
vehicle_class: ['Two-Door Car' 'Four-Door Car' 'SUV' 'Sports Car' 'Luxury SUV'
 'Luxury Car']

## Treat weird data formatting

In [8]:
def data_type_formatting(df):
    df['customer_lifetime_value'] = df['customer_lifetime_value'].str.rstrip('%').apply(float)
    df['number_of_open_complaints'] = df['number_of_open_complaints'].str.split('/').str[1].astype(float)   
    return df

data = data_type_formatting(data)
data1 = data_type_formatting(data1) #only for data and data1 needed

## Treat NaN values

In [9]:
print(data.customer.isnull().sum())
print(data1.customer_lifetime_value.isnull().sum())
print(data2.customer_lifetime_value.isnull().sum())

2937
4
0

In [10]:
data.dropna(subset = ['customer','customer_lifetime_value'], inplace = True)
data.gender.fillna(data.gender.mode()[0], inplace = True)
data1.dropna(subset = ['customer_lifetime_value'], inplace = True)

## Convert floats to integers

In [11]:
def float_to_integers(df):
    df['income'] = df['income'].apply(int)
    df['monthly_premium_auto'] = df['monthly_premium_auto'].apply(int)
    df['total_claim_amount'] = df['total_claim_amount'].apply(int)
    df['customer_lifetime_value'] = df['customer_lifetime_value'].apply(int)
    df['number_of_open_complaints'] = df['number_of_open_complaints'].apply(int)
    return df

In [12]:
data = float_to_integers(data)
data1 = float_to_integers(data1)
data2 = float_to_integers(data2)

## Align column order

In [13]:
column_order = ['customer', 'state', 'gender', 'education', 'income', 'customer_lifetime_value', 
              'monthly_premium_auto', 'number_of_open_complaints', 'policy_type', 'vehicle_class']
data = data[column_order]
data1 = data1[column_order]
data2 = data2[column_order]

In [23]:
data.head(2)

,customer,state,gender,education,income,customer_lifetime_value,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class
1,QZ44356,Arizona,F,Bachelor,0,697953,94,0,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,48767,1288743,108,0,Personal Auto,Two-Door Car

In [22]:
data1.head(2)

,customer,state,gender,education,income,customer_lifetime_value,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,16061,323912,88,0,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,79487,462680,114,0,Special Auto,Luxury

In [21]:
data2.head(2)

,customer,state,gender,education,income,customer_lifetime_value,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class
0,SA25987,Washington,M,High School or Below,0,3479,104,0,Personal Auto,Two-Door Car
1,TB86706,Arizona,M,Master,0,2502,66,0,Personal Auto,Two-Door Car

## Combine data

In [27]:
df = pd.concat([data, data1, data2])
df.head(2)

,customer,state,gender,education,income,customer_lifetime_value,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class
1,QZ44356,Arizona,F,Bachelor,0,697953,94,0,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,48767,1288743,108,0,Personal Auto,Two-Door Car

In [29]:
df.size

91300

# Challenge 2

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [45]:
df1 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv')
df1.head(2)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1

In [46]:
df1.drop('unnamed:_0', axis = 1, inplace = True)
df1.head(2)

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,48029,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,0,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [61]:
pivot_df1 = df1.pivot_table(index = 'sales_channel', values = ['customer_lifetime_value'], aggfunc='sum')
pivot_df1 = pivot_df1.customer_lifetime_value.apply(lambda y: "{:.2e}".format(y))
pivot_df1 
# The Agent channel resulted in the highest total revenues, followed by Branch, Call Center, and Web. 
# The Agent channel resulted in double the revenues compared to the Call Center branch.

sales_channel
Agent          3.31e+07
Branch         2.44e+07
Call Center    1.74e+07
Web            1.27e+07
Name: customer_lifetime_value, dtype: object

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [68]:
pivot1_df1 = df1.pivot_table(index = 'gender', columns = 'education', values = ['customer_lifetime_value'], aggfunc = 'mean')
pivot1_df1 = pivot1_df1.customer_lifetime_value.apply(lambda y: round(y, 2))
pivot1_df1
# People with Master and High School or Below education brought the highest total revenues. 
# People with Bachelor, College and Doctor education brought relatively equal equal total revenues.
# Females with a High School or Below education had higher total revenues by 500$ than males.
# Males with a College education had higher total revenues by 300$ compared to females.
# People with Bachelor, Doctor and Master degree do not result in gender specific total revenues.

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7874.27  7748.82  7328.51               8675.22  8157.05
M           7703.60  8052.46  7415.33               8149.69  8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here